ChangLe-Luo/STM32-Environment-Monitoring-System/STM32_EMS_Driver/Src/Drivers/MQ135空气质量传感器/MQ135.c
#include "stm32f10x.h"  // Device header
#include "AD.h"
#include "Delay.h"
#include <math.h>  // 包含数学函数声明
#include "MQ135.h"

/**
  * @brief  根据MODE选择初始化对应io口的模式
  * @param	None
  * @retval	None
  */
void MQ135_Init(void)
{
	#if MODE
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOx,ENABLE);
		
		GPIO_InitTypeDef GPIO_InitStruct;
		GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AIN;
		GPIO_InitStruct.GPIO_Pin = GPIO_Pin_x;
		GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
		
		GPIO_Init(GPIOx,&GPIO_InitStruct);
		
		AD_Init();
	}
	#else 
	{
		RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOx,ENABLE);
		
		GPIO_InitTypeDef GPIO_InitStruct;
		GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IPU;//低电平有效，设置上拉输入防止误触
		GPIO_InitStruct.GPIO_Pin = GPIO_Pin_x;
		GPIO_InitStruct.GPIO_Speed = GPIO_Speed_50MHz;
		
		GPIO_Init(GPIOx,&GPIO_InitStruct);
	}
	#endif
}

/**
  * @brief	将接收到的空气质量转换成对应数值
  * @param  None
  * @retval 当MODE==1时，输出一个float类型的四位整数，小数点后两位（否则一个标志位，低电平有污染物）
  */
float MQ135_GetPPM(void)
{
	#if MODE
	{
		float  tempData = 0;
	

		for (uint8_t i = 0; i < MQ135_READ_TIMES; i++)
		{
			tempData += AD_GetValue(ADC_Channel_x);//求累加值
			Delay_ms(5);
		}
		tempData /= MQ135_READ_TIMES;//对累加值求平均
	
		float Vol = (tempData*5/4096);//转换成模拟电压数值
		float RS = (5-Vol)/(Vol*0.5);
		float R0=6.64;

		float ppm = pow(11.5428*R0/RS, 0.6549f);
		return ppm;
	}
	#else
	{
		uint8_t Temp = GPIO_ReadInputDataBit(GPIOx,GPIO_Pin_x);//低电平有污染物
		return Temp;
	}
	#endif
}